[
    ["What is your favorite game?", "I love The Witcher 3, Minecraft, and Fortnite!"],
    ["What is your loved game?", "I love The Witcher 3, Minecraft, and Fortnite!"],
    ["Who created Minecraft?", "Markus Persson, also known as Notch, created Minecraft."],
    ["What is a DLC?", "It means downloadable content that adds new features or missions."],
    ["What is the best-selling video game of all time?", "Minecraft is the best-selling video game of all time."],
    ["What is a speedrun?", "A speedrun is completing a game as fast as possible, often using glitches."],
    ["What is the most popular game in 2023?", "As of 2023, Fortnite and Call of Duty are among the most popular games."],
    ["What is an Easter egg in gaming?", "An Easter egg is a hidden feature or message in a game."],
    ["What does 'GG' mean?", "'GG' means 'good game', often used at the end of a match."],
    ["What is a battle royale game?", "A battle royale game involves many players fighting until one remains."],
    ["What is VR gaming?", "VR gaming uses virtual reality technology to create immersive experiences."],
    ["Who is Mario?", "Mario is a fictional character and the mascot of Nintendo."],
    ["What is loot in gaming?", "Loot refers to items or rewards obtained in games, often from defeating enemies."],
    ["What does 'PVP' stand for?", "'PVP' stands for player versus player, where players compete against each other."],
    ["What is a noob?", "A noob is a slang term for a new or inexperienced player."],
    ["What are microtransactions?", "Microtransactions are small purchases made within a game for additional content."],
    ["What is an MMORPG?", "An MMORPG is a massively multiplayer online role-playing game."],
    ["What does 'AFK' mean?", "'AFK' means away from keyboard, indicating someone is temporarily unavailable."],
    ["What is modding?", "Modding refers to modifying a game to add new features or change gameplay."],
    ["Who developed Fortnite?", "Epic Games developed Fortnite."],
    ["What is cross-platform play?", "Cross-platform play allows players on different platforms to play together."],
    ["What does 'lag' mean in gaming?", "'Lag' refers to delays between player actions and game responses due to network issues."],
    ["What is a game engine?", "A game engine is software used to create and develop video games."],
    ["What is a quest in gaming?", "A quest is a task or mission given to players to complete in a game."],
    ["What does 'NPC' stand for?", "'NPC' stands for non-player character, which is controlled by the game."],
    ["What is a patch in gaming?", "A patch is an update that fixes bugs or adds new content to a game."],
    ["What is a leaderboard?", "A leaderboard displays the rankings of players based on their performance."],
    ["What does 'DLC' stand for?", "'DLC' stands for downloadable content, which adds new features or missions to a game."],
    ["What is a sandbox game?", "A sandbox game allows players to explore and create freely without specific objectives."],
    ["What is a boss fight?", "A boss fight is a challenging encounter with a powerful enemy in a game."],
    ["What does 'GGWP' mean?", "'GGWP' means 'good game, well played', used to commend opponents."],
    ["What does 'RPG' stand for?", "'RPG' stands for role-playing game, where players assume the roles of characters."],
    ["What is a game trailer?", "A game trailer is a promotional video showcasing gameplay and features."],
    ["What does 'K/D ratio' mean?", "'K/D ratio' means kill/death ratio, measuring a player's performance in combat."],
    ["What is a save point?", "A save point is a location in a game where players can save their progress."],
    ["What does 'LFG' mean?", "'LFG' means looking for group, used to find players for multiplayer games."],
    ["What is a game franchise?", "A game franchise is a series of related games sharing characters or themes."],
    ["What does 'TBA' mean?", "'TBA' means to be announced, indicating future information is pending."],
    ["What is a game demo?", "A game demo is a limited version of a game for players to try before purchase."],
    ["What does 'WIP' mean?", "'WIP' means work in progress, indicating ongoing development of a game."],
    ["What is a cutscene?", "A cutscene is a cinematic sequence in a game that advances the story."],
    ["What does 'FOV' stand for?", "'FOV' stands for field of view, referring to the visible area in a game."],
    ["What is a game developer?", "A game developer is a person or company that creates video games."],
    ["What is a game publisher?", "A game publisher is a company that finances and distributes video games."],
    ["What is a beta test?", "A beta test is a pre-release version of a game for testing by players."],
    ["What does 'FPS' stand for?", "'FPS' stands for first-person shooter, a genre where players see through the character's eyes."],
    ["What is an open-world game?", "An open-world game allows players to explore a large, unrestricted environment."],
    ["What does 'RTS' stand for?", "'RTS' stands for real-time strategy, where players manage resources and units in real time."],
    ["What is a cheat code?", "A cheat code is a combination of buttons or commands that unlocks special features or abilities."],
    ["What is an indie game?", "An indie game is developed by individuals or small teams without major publishers."],
    ["What does 'MMO' stand for?", "'MMO' stands for massively multiplayer online, referring to games with large player bases."],
    ["What is a skin in gaming?", "A skin is a cosmetic item that changes the appearance of characters or items in a game."],
    ["What does 'Gamer Tag' mean?", "'Gamer Tag' refers to a player's unique username in online gaming platforms."],
    ["What is a clan in gaming?", "A clan is a group of players who team up and play together in games."],
    ["What does 'XP' stand for?", "'XP' stands for experience points, which players earn to level up their characters."],
    ["What is a game engine?", "A game engine is software used to create and develop video games."],
    ["What does 'DPS' mean?", "'DPS' means damage per second, measuring the damage output of a character or weapon."],
    ["What is a game soundtrack?", "A game soundtrack is the music composed for a video game."],
    ["What does 'Gacha' mean?", "'Gacha' refers to a game mechanic where players spend in-game currency for random rewards."],
    ["What is a game community?", "A game community is a group of players who share interests and experiences related to a game."],
    ["What does 'TOS' stand for?", "'TOS' stands for terms of service, outlining the rules and guidelines for using a service."],
    ["What is a game engine?", "A game engine is software used to create and develop video games."],
    ["What does 'LOL' mean?", "'LOL' means laughing out loud, often used in online chats."],
    ["What is a game studio?", "A game studio is a company that develops video games."],
    ["What does 'BRB' mean?", "'BRB' means be right back, indicating someone will return shortly."],
    ["What is a game patch?", "A game patch is an update that fixes bugs or adds new content to a game."],
    ["What does 'GG EZ' mean?", "'GG EZ' means 'good game, easy', often used sarcastically after winning easily."],
    ["What is a loot box?", "A loot box is a virtual item containing random rewards in games."],
    ["What does 'OP' mean?", "'OP' means overpowered, referring to characters or items that are too strong."],
    ["What is an achievement in gaming?", "An achievement is a reward for completing specific tasks or challenges in a game."],
    ["What does 'PvE' stand for?", "'PvE' stands for player versus environment, where players fight against computer-controlled enemies."],
    ["What is an expansion pack?", "An expansion pack adds new content and features to an existing game."],
    ["What does 'SFX' stand for?", "'SFX' stands for sound effects, referring to audio elements in games."],
    ["What is a speedrun leaderboard?", "A speedrun leaderboard ranks players based on their completion times for specific games."],
    ["The Legend of Zelda: Ocarina of Time Inside the Deku Tree, your first dungeon inside the guardian spirit of the Kokiri Forest, requires navigating puzzles and enemies in a hollowed tree.", "Destroy the parasitic curse inside the Deku Tree by defeating Queen Gohma."],
    ["Super Mario 64 Bob-omb Battlefield is a wide-open area with Bob-ombs and Goombas where Mario must complete challenges to collect stars.", "Defeat King Bob-omb at the top of the mountain to earn the first star."],
    ["Portal Test Chamber 18 features turrets, timed platforms, and advanced portal use to reach the elevator exit.", "Use portals to disable turrets and activate platforms in sequence to exit the chamber."],
    ["Dark Souls Undead Burg is an early game area filled with ambushes, narrow pathways, and hidden enemies.", "Proceed cautiously, use a shield to block ambushes, and defeat the Taurus Demon to advance."],
    ["Hollow Knight Greenpath is a lush, toxic forest area filled with thorns and new enemies requiring precise movement.", "Explore thoroughly, use ranged attacks on dangerous foes, and defeat Hornet to continue the journey."],
    ["The Elder Scrolls V: Skyrim Helgen Keep is the starting area where players witness the dragon Alduin's attack and escape captivity.", "Follow the NPCs, choose a path, and escape the burning keep to begin your adventure."],
    ["Final Fantasy VII Midgar is a sprawling city with Shinra's oppressive presence, featuring the iconic Mako Reactor.", "Complete missions for AVALANCHE and escape Midgar to explore the world."],
    ["The Legend of Zelda: Breath of the Wild Great Plateau is the game's tutorial area, introducing mechanics and shrines.", "Complete the four shrines to unlock the Paraglider and leave the plateau."],
    ["Overwatch King's Row is a hybrid map combining escort and control point gameplay set in a dystopian London.", "Escort the payload through King's Row while defending against enemy attacks."],
    ["League of Legends Summoner's Rift is a classic 5v5 map with three lanes, jungle, and objectives like Dragon and Baron.", "Work with your team to destroy the enemy Nexus while defending your own."],
    ["Counter-Strike: Global Offensive Dust II is a popular bomb defusal map set in a Middle Eastern town.", "Plant the bomb at one of the sites or defuse it if you're on the counter-terrorist team."],
    ["Minecraft The End is the final dimension where players face the Ender Dragon and explore the End Cities.", "Defeat the Ender Dragon to access the End Cities and collect valuable loot."],
    ["World of Warcraft Orgrimmar is the capital city of the Horde, featuring a bustling marketplace and quest givers.", "Complete quests in Orgrimmar to gain reputation and resources for your character."],
    ["Call of Duty: Warzone Verdansk is a large battle royale map with diverse environments and strategic locations.", "Loot weapons, gear, and vehicles while avoiding the gas circle to be the last player standing."],
    ["Animal Crossing: New Horizons Your Island is a customizable paradise where players can build, decorate, and interact with villagers.", "Collect resources, craft items, and invite villagers to create your dream island."],
    ["Apex Legends Kings Canyon is a dynamic battle royale map with varied terrain and unique locations.", "Use legends' abilities strategically to outsmart opponents and claim victory."],
    ["Fortnite Chapter 2 Island features a constantly changing landscape with new locations and events each season.", "Complete challenges, gather resources, and build structures to survive against other players."],
    ["The Witcher 3: Wild Hunt Kaer Morhen is Geralt's childhood home, serving as a training ground for witchers.", "Complete quests related to Geralt's past while exploring the snowy mountains."],
    ["Celeste Summit is a challenging platforming area where players must navigate treacherous terrain to reach the summit.", "Use precise jumps and dashes to overcome obstacles and reach the top."],
    ["Stardew Valley Pelican Town is a charming farming community where players can grow crops, raise animals, and build relationships.", "Manage your farm, complete quests, and participate in seasonal events."],
    ["Among Us The Skeld is a spaceship map where players must complete tasks while identifying impostors among them.", "Work together to complete tasks or sabotage others without getting caught."],
    ["Genshin Impact Mondstadt is a vibrant city inspired by European architecture, filled with quests and characters.", "Explore Mondstadt's surroundings while completing quests for various factions."],
    ["Final Fantasy XIV Eorzea is a vast world filled with diverse regions, dungeons, and raids for players to explore.", "Join parties to tackle challenging content while leveling up your character."],
    ["Persona 5 Tokyo is a modern-day city where players balance school life, social interactions, and dungeon crawling.", "Build relationships with characters while exploring the Metaverse to fight Shadows."],
    ["Dark Souls III Lothric Castle is a gothic castle filled with powerful enemies and intricate pathways.", "Defeat the Lothric Knights and the final boss to complete the game."],
    ["Sekiro: Shadows Die Twice Ashina Castle is a sprawling fortress filled with enemies and hidden paths.", "Use stealth and combat skills to navigate the castle and defeat powerful foes."],
    ["Resident Evil 2 Raccoon City Police Department is a haunting location filled with zombies and puzzles.", "Solve puzzles, find keys, and survive the horrors of Raccoon City."],
    ["The Last of Us Part II Jackson is a safe haven for survivors in a post-apocalyptic world, featuring community life and relationships.", "Explore Jackson while uncovering the story of Ellie and her journey."],
    ["Cyberpunk 2077 Night City is a sprawling metropolis filled with cybernetic enhancements, gangs, and corporate intrigue.", "Complete missions while navigating the dangerous streets of Night City."],
    ["Ghost of Tsushima Tsushima Island is a beautiful open-world setting during the Mongol invasion of Japan.", "Use stealth and combat skills to liberate villages from Mongol control."],
    ["Hades The Underworld is a procedurally generated dungeon filled wiDOOM Eternal Hell is a chaotic battleground filled with demons and intenseth mythological creatures and challenges.", "Fight your way through the Underworld while uncovering Zagreus's story."],
    [" combat.", "Use weapons and abilities to defeat hordes of enemies in fast-paced action."]

]   
